# Brewfile — Personal MacBook
# Install: brew bundle --file=~/Workspace/dotfiles/Brewfile

###############################################################################
# CLI — Core
###############################################################################

brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gawk"
brew "grep"
brew "curl"
brew "openssh"

###############################################################################
# CLI — Development
###############################################################################

brew "git"
brew "git-lfs"
brew "gh"
brew "jq"
brew "yq"
brew "tmux"
brew "ast-grep"
brew "mas"
brew "dockutil"
brew "displayplacer"

###############################################################################
# CLI — Shell
###############################################################################

brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

###############################################################################
# Languages & Runtimes
###############################################################################

brew "uv"
brew "python@3.14" # bootstrap TOML validation/merge
brew "rustup"
brew "bun"
brew "nvm"
brew "rbenv"
brew "ruby-build"

###############################################################################
# Apps — Productivity
###############################################################################

cask "raycast"
cask "1password"
cask "superwhisper"
cask "claude"
cask "arc"
cask "obsidian"

###############################################################################
# Apps — Development
###############################################################################

cask "visual-studio-code"
cask "google-chrome"
cask "db-browser-for-sqlite"
cask "docker-desktop"

###############################################################################
# Apps — AI
###############################################################################

cask "codex-app"
cask "claude-code"
brew "ollama"

###############################################################################
# Apps — Media & Utilities
###############################################################################

cask "stremio"
cask "vlc"
cask "qbittorrent"
cask "logi-options+"

###############################################################################
# Apps — Networking
###############################################################################

cask "tailscale-app"
cask "private-internet-access"

###############################################################################
# Apps — Cloud Storage
###############################################################################

cask "synology-drive"
cask "google-drive"

###############################################################################
# Mac App Store
###############################################################################

mas "Things 3", id: 904280696
mas "Hand Mirror", id: 1502839586
mas "Folder Peek", id: 1615988943
mas "Xcode", id: 497799835
