# Brewfile for agent-focused Mac Mini
# Install: brew bundle --file=~/.dotfiles/Brewfile

###############################################################################
# CLI Tools - Core Utilities
###############################################################################

brew "coreutils"        # GNU core utilities (gls, gcp, etc.)
brew "findutils"        # GNU find, xargs, locate
brew "gnu-sed"          # GNU sed
brew "gawk"             # GNU awk
brew "grep"             # GNU grep
brew "wget"             # Download files
brew "curl"             # Transfer data (newer than system)
brew "openssh"          # SSH (newer than system)

###############################################################################
# CLI Tools - Development
###############################################################################

brew "git"              # Version control
brew "git-lfs"          # Git Large File Storage
brew "gh"               # GitHub CLI
brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "tmux"             # Terminal multiplexer
brew "shellcheck"       # Shell script linter
brew "shfmt"            # Shell script formatter
brew "exiftool"         # Read/write image metadata
brew "mas"              # Mac App Store CLI

###############################################################################
# Languages & Version Managers
###############################################################################

# Python
brew "pyenv"            # Python version manager
brew "pyenv-virtualenv" # Virtualenv plugin for pyenv
brew "pipx"             # Install Python apps in isolated envs
brew "uv"               # Fast Python package/project manager

# Node.js
brew "nvm"              # Node version manager

# Bun
brew "oven-sh/bun/bun"  # Fast JavaScript runtime/bundler

# Ruby
brew "rbenv"            # Ruby version manager
brew "ruby-build"       # Install Ruby versions

# Go
brew "go"               # Go language

# Rust
brew "rustup-init"      # Rust toolchain installer

###############################################################################
# Shell Enhancements
###############################################################################

brew "zsh-autosuggestions"
brew "zsh-completions"

###############################################################################
# Applications - Productivity
###############################################################################

cask "raycast"          # Spotlight replacement
cask "google-chrome"    # Browser
cask "obsidian"         # Note-taking and knowledge management

###############################################################################
# Applications - Development
###############################################################################

cask "cursor"           # AI code editor
cask "ghostty"          # GPU-accelerated terminal
cask "db-browser-for-sqlite"  # SQLite database browser

###############################################################################
# AI Coding CLIs
###############################################################################

brew "gemini-cli"       # Google Gemini CLI
cask "codex"            # OpenAI Codex CLI
cask "claude-code"      # Anthropic Claude Code CLI

###############################################################################
# Applications - Cloud Storage
###############################################################################

cask "synology-drive"   # Synology NAS sync
cask "google-drive"     # Google Drive sync

###############################################################################
# Applications - Utilities
###############################################################################

cask "logi-options+"    # Logitech mouse/keyboard customization

###############################################################################
# Applications - Privacy & Security
###############################################################################

cask "tailscale"                 # Mesh VPN for secure networking
cask "private-internet-access"   # PIA VPN

###############################################################################
# Mac App Store Apps
###############################################################################

mas "Things 3", id: 904280696
mas "Folder Peek", id: 1615988943  # Menu bar folder access
